wjcloudy/mowglinext/firmware/stm32/ros_usbnode/src/drivemotor.c
        /* todo add also accelerometer detection*/
#if BOARD_YARDFORCE500B_LFP
        //CLOUDY low-level bump reflex (TEMPORARY): on contact, back off a short distance.
        //This is a stop-gap. The ROS2 high level (Nav2 collision_monitor -> StuckBackoff in
        //mowgli_behavior) is intended to own obstacle recovery, and the bump is NOT reported
        //up to ROS2. TODO: remove this reflex once the lidar/costmap recovery path is trusted,
        //so the firmware doesn't fight Nav2's cmd_vel. (We removed the bump-count->simulate-HOME
        //escalation - the behavior tree's MarkSegmentBlocked/FailedCoverageDock owns that now.)
        if ((HALLSTOP_Left_Sense() || HALLSTOP_Right_Sense()) && (left_dir_req || right_dir_req))
        {
            if (bump_started == 0)
            {
                bump_started = now; //CLOUDY start the bump debounce timer
            }
            switch (main_eOpenmowerStatus)
            {
            case OPENMOWER_STATUS_MOWING:
                if (now - bump_started >= BUMP_MILLIS_WHILE_MOWING)
                {
                    /*hit something, back off a little */
                    drivemotor_eState = DRIVEMOTOR_BACKWARD;
                    l_u32Timestamp = HAL_GetTick();
                }
                break;
            case OPENMOWER_STATUS_DOCKING:
                /* Get voltage from dock, stop the mower*/
                if (chargerInputVoltage > MIN_DOCKED_VOLTAGE)
                {
                    drivemotor_prepareMsg(0, 0, 0, 0);
                }
                else
                { /*hit something, back off a little */
                    if (now - bump_started >= BUMP_MILLIS_WHILE_DOCKING)
                    {
                        drivemotor_eState = DRIVEMOTOR_BACKWARD;
                        l_u32Timestamp = HAL_GetTick();
                    }
                }

                break;
            case OPENMOWER_STATUS_UNDOCKING:
            case OPENMOWER_STATUS_IDLE:
            case OPENMOWER_STATUS_RECORD:
            default:
                /* nothing to do in these modes*/
                break;
            }
        }
        else
        {
            bump_started = 0; //CLOUDY bump cleared: reset the debounce so it triggers on every fresh bump
        }
#else
        if ((HALLSTOP_Left_Sense() || HALLSTOP_Right_Sense()) && (left_dir_req || right_dir_req))
        {

            switch (main_eOpenmowerStatus)
            {
            case OPENMOWER_STATUS_MOWING:
                /*hit something goes back */
                drivemotor_eState = DRIVEMOTOR_BACKWARD;
                l_u32Timestamp = HAL_GetTick();
                break;
            case OPENMOWER_STATUS_DOCKING:
                /* Get voltage from dock, stop the mower*/
                if (chargerInputVoltage > MIN_DOCKED_VOLTAGE)
                {
                    drivemotor_prepareMsg(0, 0, 0, 0);
                }
                else
                { /*hit something goes back */
                    drivemotor_eState = DRIVEMOTOR_BACKWARD;
                    l_u32Timestamp = HAL_GetTick();
                }

                break;
            case OPENMOWER_STATUS_UNDOCKING:
            case OPENMOWER_STATUS_IDLE:
            case OPENMOWER_STATUS_RECORD:
            default:
                /* nothing to do in these modes*/
                break;
            }
        }
#endif

        HAL_UART_Transmit_DMA(&DRIVEMOTORS_USART_Handler, (uint8_t *)drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG);

        break;

    case DRIVEMOTOR_BACKWARD:
        /* prepare to receive the message before to launch the command */
        HAL_UART_Receive_DMA(&DRIVEMOTORS_USART_Handler, (uint8_t *)&drivemotor_psReceivedData, sizeof(DRIVEMOTORS_data_t));
        drivemotor_prepareMsg(100, 100, 0, 0); /* set to -0.33m/s  */
        HAL_UART_Transmit_DMA(&DRIVEMOTORS_USART_Handler, (uint8_t *)drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG);

#if BOARD_YARDFORCE500B_LFP
        if ((HAL_GetTick() - l_u32Timestamp) > BUMP_REVERSE_MILLIS) //CLOUDY shorter back-off on bump (was 2000ms)
#else
        if ((HAL_GetTick() - l_u32Timestamp) > 2000)
#endif
        {
            drivemotor_eState = DRIVEMOTOR_WAIT;
            l_u32Timestamp = HAL_GetTick();
        }

        break;

    case DRIVEMOTOR_WAIT:
        /* prepare to receive the message before to launch the command */
        HAL_UART_Receive_DMA(&DRIVEMOTORS_USART_Handler, (uint8_t *)&drivemotor_psReceivedData, sizeof(DRIVEMOTORS_data_t));
        drivemotor_prepareMsg(0, 0, 0, 0);
        HAL_UART_Transmit_DMA(&DRIVEMOTORS_USART_Handler, (uint8_t *)drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG);

        if ((HAL_GetTick() - l_u32Timestamp) > 1000)
        {
            drivemotor_eState = DRIVEMOTOR_RUN;
        }

        break;

    default:
        break;
    }

    /* TODO error management */
    switch (drivemotors_eRxFlag)
    {
    case RX_VALID:
        break;

    case RX_WAIT:

        /* todo check for timeout */

        break;

    case RX_CRC_ERROR:
    case RX_INVALID_ERROR:
    case RX_TIMEOUT_ERROR:
    default:
        /* inform for error */
        break;
    }
}

/// @brief Resolve the physical travel direction of a wheel for odometry.
///
/// The drive controller flips its reported direction bit one to two frames
/// BEFORE the wheel has actually reversed. For those frames it reports the new
/// direction with a speed byte of 0 while the wheel is really still coasting in
/// the OLD direction. Believing that bit feeds odometry a few ticks with the
/// wrong sign on every reversal (which here corrupts BOTH /wheel_odom and the
/// wheel-PI loop, since both consume left/right_ticks_signed).
///
/// So a reported reversal (opposite sign to the committed direction) is only
/// adopted once the new segment is confirmed by EITHER
///   (B) the reported speed byte going non-zero (controller now actively
///       driving the new direction), OR
///   (A) a second counter reset (the controller's documented double-reset that
///       brackets the real new segment).
/// Until then the previously committed direction keeps being reported. Resumes
/// in the same direction and the first motion from rest carry no stale motion
/// to mis-sign, so they are adopted immediately.
///
/// @param f         per-wheel filter state (updated in place)
/// @param reported  decoded reported direction this frame (-1/0/+1)
/// @param speed     reported speed byte this frame
/// @param reset     non-zero if the raw counter decreased this frame (a reset)
/// @return the committed (publishable) travel direction
static int8_t resolve_direction(DRIVEMOTOR_dirfilter_t *f, int8_t reported, uint8_t speed, int reset)
{
    if (reported != 0 && (speed != 0 || f->s8Eff == 0))
    {
        /* (B) the speed byte confirms real motion in the reported direction -
         * or this is the first motion from rest, with no old direction to
         * protect. Either way, believe the reported direction immediately. */
        f->s8Eff = reported;
        f->u8Resets = 0;
    }
    else if (reported == -f->s8Eff)
    {
        /* Unconfirmed reversal: the controller reports the opposite direction
         * but the speed byte is still 0 while the wheel coasts the old way.
         * Keep the old direction until (A) a second counter reset confirms the
         * real new segment. (Frames here have speed 0, handled above first.) */
        if (reset && ++f->u8Resets >= 2)
        {
            f->s8Eff = reported;
            f->u8Resets = 0;
        }
    }
    else
    {
        /* stop report or same-direction frame: no reversal in progress */
        f->u8Resets = 0;
    }
    return f->s8Eff;
}

/// @brief Fold one controller frame into a wheel's tick totals + travel dir.
///
/// Rule 1 - detect the counter reset DIRECTLY: any decrease in the controller's
/// per-wheel counter means it reset to 0, so the progress since the reset is the
/// new value; otherwise the counter rose and we add the difference. (The old
/// code PREDICTED the reset from direction/speed edges and pre-synced prev_*,
/// which raced the controller's one-frame reset latency and scored the pre-reset
/// count as a phantom jump.) A reset whose remainder exceeds one frame's
/// kinematic limit is a glitch and is dropped rather than accumulated.
///
/// Rule 2 - the magnitude is signed by the CONFIRMED direction from
/// resolve_direction(), not the reported byte, so coast ticks on a reversal
/// keep the old sign until the wheel has truly turned around.
///
/// Accumulates both the legacy unsigned-abs counter (*ticks) and the signed
/// cumulative counter (*ticks_signed, consumed by the host + wheel-PI loop).
///
/// @return the committed (publishable) travel direction for this wheel.
static int8_t DRIVEMOTOR_UpdateWheel(DRIVEMOTOR_dirfilter_t *f, int8_t reported, uint8_t speed,
                                     uint16_t val, uint16_t *prev,
                                     uint32_t *ticks, int32_t *ticks_signed)
{
    int32_t l_s32Delta = (int32_t)val - (int32_t)*prev;
    /* Confirmed travel direction for THIS frame's motion. */
    int8_t l_s8Eff = resolve_direction(f, reported, speed, l_s32Delta < 0);

    uint32_t l_u32Mag = 0;
    if (reported != 0)
    {
        if (l_s32Delta >= 0)
        {
            l_u32Mag = (uint32_t)l_s32Delta;             /* progress within a segment */
        }
        else if ((uint32_t)val <= DRIVEMOTOR_MAX_TICKS_PER_FRAME)
        {
            l_u32Mag = (uint32_t)val;                    /* reset: new-segment progress so far */
        }
        /* else: implausibly large reset remainder => glitch, drop it */
    }
    *prev = val;
    *ticks += l_u32Mag;                                  /* legacy unsigned-abs counter */
    *ticks_signed += (int32_t)l_u32Mag * (int32_t)l_s8Eff;  /* signed by CONFIRMED dir */
    return l_s8Eff;
}

/// @brief Decode received drive motor messages
/// @param
void DRIVEMOTOR_App_Rx(void)
{
    if (drivemotors_eRxFlag == RX_VALID)
    {
        /* decode */
        uint8_t direction = drivemotor_psReceivedData.u8_direction;
        // we need to adjust for direction (+/-) !
        if ((direction & 0xc0) == 0xc0)
        {
            left_direction = 1;
        }
        else if ((direction & 0x80) == 0x80)
        {
            left_direction = -1;
        }
        else
        {
            left_direction = 0;
        }
        if ((direction & 0x30) == 0x30)
        {
            right_direction = 1;
        }
        else if ((direction & 0x20) == 0x20)
        {
            right_direction = -1;
        }
        else
        {
            right_direction = 0;
        }

        left_encoder_val = drivemotor_psReceivedData.u16_left_ticks;
        right_encoder_val = drivemotor_psReceivedData.u16_right_ticks;

        // power consumption
        left_power = drivemotor_psReceivedData.u8_left_power;
        right_power = drivemotor_psReceivedData.u8_right_power;

